Revit 2024 API
FabricationPartRouteEnd Members
The FabricationPartRouteEnd type exposes the following members.
Methods
Name | Description
CreateFromCenterline
 Create fabrication routing end from centerline point on straight element.
CreateFromConnector
 Create fabrication routing end from connector end point.
Dispose
Releases all resources used by the FabricationPartRouteEnd
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace